def print_arr(_arr):
    for row in _arr:
        print(row)
    print()


# 3*5 배열 arr
arr = [[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 10],
       [11, 12, 13, 14, 15]]

arr_clockwise_90 = [list(row) for row in zip(*arr[::-1])]
"""
arr = [[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 10],
       [11, 12, 13, 14, 15]]
arr[::-1] = [[11, 12, 13, 14, 15],
             [6, 7, 8, 9, 10],
             [1, 2, 3, 4, 5]]
unpakcing해서 zip -> (11, 6, 1), (12, 7, 2), ...
zip한 결과는 tuple이므로 list로 바꿔서 저장
"""

arr_clockwise_180 = [row[::-1] for row in arr[::-1]]
"""
arr = [[1, 2, 3, 4, 5],
       [6, 7, 8, 9, 10],
       [11, 12, 13, 14, 15]]
arr[::-1] = [[11, 12, 13, 14, 15], -> row, row[::-1]: [15, 14, 13, 12, 11]
             [6, 7, 8, 9, 10], -> row, row[::-1]: [10, 9, 8, 7, 6]
             [1, 2, 3, 4, 5]] -> row, row[::-1]: [5, 4, 3, 2, 1]
"""

arr_clockwise_270 = [list(row) for row in zip(*arr)][::-1]
"""
arr = [[1, 2, 3, 4, 5]
       [6, 7, 8, 9, 10]
       [11, 12, 13, 14, 15]]
unpacking해서 캬ㅔ -> (1, 6, 11), (2, 7, 12), ...
zip한 결과는 tuple이므로 list로 바꿔서 저장
[[1, 6, 11],
 [2, 7, 12],
 [3, 8, 13],
 [4, 9, 14],
 [5, 10, 15]]
이걸 [::-1]로 뒤집기
"""
